test27: proc options(main);
    dcl x fixed bin(31);
    dcl y fixed bin(31);
    dcl r fixed bin(31);
    x = 0 - 7;
    y = 3;
    r = abs(x);
    put skip list('abs=', r);
    r = sqrt(16);
    put skip list('sqrt16=', r);
    r = ceil(2);
    put skip list('ceil=', r);
    r = floor(2);
    put skip list('floor=', r);
    r = round(3);
    put skip list('round=', r);
    r = trunc(5);
    put skip list('trunc=', r);
    r = sign(x);
    put skip list('sign=', r);
    r = max(x, y);
    put skip list('max=', r);
    r = min(x, y);
    put skip list('min=', r);
end test27;
