dowhile: PROC OPTIONS(MAIN);
/* test do_while loop */
dcl x fixed bin(15);
  put skip list('***running dowhile***');
  x = 10;  
  do while(x > 0);
    x = x - 1; 
    put skip list('x in loop:', x);	
  end; 
  put skip list('x after loop:', x);
end dowhile;

