simple: PROC OPTIONS(MAIN);
/* test arithmetic expression, pus skip, multiline comment  */
/* multiple lines comment
two 
line */
dcl x fixed bin(15);
dcl y fixed bin(31);
dcl z char(10);
dcl w(5) fixed bin(15);

put skip list('***running simple***');
  x = 10;
  if x = 10
  then
    put skip list('x=', 10);  
  else  
    put skip list('x<>', 10);   
  x = x + (10 * 2);
  put skip list('x + 10 * 2 = ', x);    
end simple;